#+Title: Introduction to Java
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2024-02-19
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv

* ArrayList
- Stores a collection of /objects/ 
- Is called a /generic class/ 
  - it can be instantiated with any type of objecs
  - uses the /diamond notation/ ~<classname>~
  - once instantiated, it can only store elements of the type ~<classname>~

#+begin_src java
  import java.util.ArrayList;

  ArrayList<String> myList = new ArrayList<>(); // Element Type is inferred from the variable.
  myList.add("Hello");
  myList.add(new String("World"));
  System.out.println(myList);

  // Built-in Datatypes do not work
  // ArrayList<int> myIntList = new ArrayList<int>();
  ArrayList<Integer> myIntList = new ArrayList<>();
  myIntList.add(Integer.valueOf(42));
  myIntList.add(12); // 12 can be "upgraded" to an instance of the Integer class
  System.out.println(myIntList);
  System.out.println(myIntList.get(0) instanceof Integer);
#+end_src

#+RESULTS:
: [Hello, World]
: [42, 12]
: true

* Traversing a Collection: for-each
#+begin_src java
  Customer c = new Customer();
  c.addTicket(new Ticket("Spartacus", "19:00 tonight"));
  c.addTicket(new Ticket("Ben Hur", "15:00 this afternoon"));

  for (Ticket t : c.getTickets()) { // For each element t of the type Ticket in collection c.getTickets()
    System.out.println(t.toString());
  }
#+end_src

#+RESULTS:
: Ticket for Spartacus at 19:00 tonight
: Ticket for Ben Hur at 15:00 this afternoon
* Other forms of Iteration: while
#+begin_src java
  int x = 5;

  while (0 <= x) {
    System.out.print(" " + x);
    x--; // If you forget this line, x will never update and the while loop will continue forever.
  }

  System.out.println();
  System.out.println("x = "+x);
#+end_src

#+RESULTS:
:  5 4 3 2 1 0
: x=-1

- Repeat while some condition tests to ~true~
- Can go on forever, if you are not careful
- Often used if you do not know when to end, e.g.
  - /while (user has not exited the menu)/
  - /while (there are more elements in the database)/
  - /while (there are more lines in this file)/
  - /while (I still have not found a movie that shows tonight)/
- Boolean expression can be arbitrarily complex:
  ~while (index < myTickets.size() && !found && !userAborted)~
* While without index
#+begin_src java
  int f0=0;
  int f1=1;
  int fn=f1 + f0; // Fibonacci Sequence

  while (fn < 100) {
    System.out.print(" " + fn);
    f0 = f1;
    f1 = fn;
    fn = f1 + f0;
  }
#+end_src

#+RESULTS:
:  1 2 3 5 8 13 21 34 55 89
* Arrays
#+begin_src java
  int[] someNumbers = new int[5];
  someNumbers[0] = 42;
  someNumbers[3] = 12;

  for(int num : someNumbers) {
    System.out.print(" " + num);
  }


  System.out.println();
  int [] otherNumbers = {23, 31, 57};
  System.out.println(otherNumbers.length); // Note -- length is an attribute and not a method
#+end_src

#+RESULTS:
:  42 0 0 12 0
: 3

- Arrays are built-in and can operate on any type.
- Arrays are /fixed size/, extending or shrinking has to be implemented by yourself
- Inserting and removing elements has to be implemented by yourself
- /May/ have better performance than e.g. ArrayList
